Autodesk.Revit.UI.IMacroManagerUIServer.ShowMacroManagerDialog(Autodesk.Revit.UI.MacroManagerUIData)
Shows dialog Macro Manager main dialog.
data:
The data on initializing the dialog as well as getting the result.
Returns:
True if the dialog was launched successfully, false otherwise.

Autodesk.Revit.UI.IMacroManagerUIServer
The interface used to provide Macro Manager UI.